{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 16, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 16, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 16, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 16, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d", "trainable": true, "batch_input_shape": [null, 10, 16, 32, 1], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice", "op": "StridedSlice", "input": ["input_3", "strided_slice/begin", "strided_slice/end", "strided_slice/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "29"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "29"}}}, "constants": {"1": [0, 0, 0, 0, 0], "2": [0, 1, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_1", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_1", "op": "StridedSlice", "input": ["input_4", "strided_slice_1/begin", "strided_slice_1/end", "strided_slice_1/strides"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "29"}, "end_mask": {"i": "29"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}}}, "constants": {"1": [0, 0, 0, 0, 0], "2": [0, 1, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_1", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_3", "trainable": true, "batch_input_shape": [null, 10, 16, 32, 1], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_3", "inbound_nodes": [[["input_2", 0, 0, {}], ["conv_lst_m2d", 0, 1, {}], ["conv_lst_m2d", 0, 2, {}]], [["lambda", 2, 0, {}], ["conv_lst_m2d_3", 0, 1, {}], ["conv_lst_m2d_3", 0, 2, {}]], [["lambda", 5, 0, {}], ["conv_lst_m2d_3", 1, 1, {}], ["conv_lst_m2d_3", 1, 2, {}]], [["lambda", 8, 0, {}], ["conv_lst_m2d_3", 2, 1, {}], ["conv_lst_m2d_3", 2, 2, {}]], [["lambda", 11, 0, {}], ["conv_lst_m2d_3", 3, 1, {}], ["conv_lst_m2d_3", 3, 2, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_1", "trainable": true, "batch_input_shape": [null, 10, 16, 32, 32], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_1", "inbound_nodes": [[["conv_lst_m2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["tf_op_layer_strided_slice", 0, 0, {}]], [["tf_op_layer_strided_slice_4", 0, 0, {}]], [["tf_op_layer_strided_slice_8", 0, 0, {}]], [["tf_op_layer_strided_slice_12", 0, 0, {}]], [["tf_op_layer_strided_slice_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["tf_op_layer_strided_slice_1", 0, 0, {}]], [["tf_op_layer_strided_slice_5", 0, 0, {}]], [["tf_op_layer_strided_slice_9", 0, 0, {}]], [["tf_op_layer_strided_slice_13", 0, 0, {}]], [["tf_op_layer_strided_slice_17", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_4", "trainable": true, "batch_input_shape": [null, 10, 16, 32, 32], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_4", "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}], ["conv_lst_m2d_1", 0, 1, {}], ["conv_lst_m2d_1", 0, 2, {}]], [["conv_lst_m2d_3", 1, 0, {}], ["conv_lst_m2d_4", 0, 1, {}], ["conv_lst_m2d_4", 0, 2, {}]], [["conv_lst_m2d_3", 2, 0, {}], ["conv_lst_m2d_4", 1, 1, {}], ["conv_lst_m2d_4", 1, 2, {}]], [["conv_lst_m2d_3", 3, 0, {}], ["conv_lst_m2d_4", 2, 1, {}], ["conv_lst_m2d_4", 2, 2, {}]], [["conv_lst_m2d_3", 4, 0, {}], ["conv_lst_m2d_4", 3, 1, {}], ["conv_lst_m2d_4", 3, 2, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_2", "trainable": true, "batch_input_shape": [null, 10, 16, 32, 16], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 8, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_2", "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]], [["conv2d_3", 1, 0, {}]], [["conv2d_3", 2, 0, {}]], [["conv2d_3", 3, 0, {}]], [["conv2d_3", 4, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]], [["conv2d_5", 1, 0, {}]], [["conv2d_5", 2, 0, {}]], [["conv2d_5", 3, 0, {}]], [["conv2d_5", 4, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcwwAAAB0AGoBfABkAYMCUwApAk7pAQAAACkC2gFL2gtleHBh\nbmRfZGltcykB2gF4qQByBQAAAPoUY29udkxTVE1fbmV3RGVjYXkucHnaCDxsYW1iZGE+QwAAAHMA\nAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["conv2d_4", 0, 0, {}]], [["conv2d_6", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["conv2d_4", 1, 0, {}]], [["conv2d_6", 1, 0, {}]], [["lambda_2", 1, 0, {}]], [["conv2d_4", 2, 0, {}]], [["conv2d_6", 2, 0, {}]], [["lambda_2", 2, 0, {}]], [["conv2d_4", 3, 0, {}]], [["conv2d_6", 3, 0, {}]], [["lambda_2", 3, 0, {}]], [["conv2d_4", 4, 0, {}]], [["conv2d_6", 4, 0, {}]], [["lambda_2", 4, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_5", "trainable": true, "batch_input_shape": [null, 10, 16, 32, 16], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 8, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_5", "inbound_nodes": [[["conv_lst_m2d_4", 0, 0, {}], ["conv_lst_m2d_2", 0, 1, {}], ["conv_lst_m2d_2", 0, 2, {}]], [["conv_lst_m2d_4", 1, 0, {}], ["conv_lst_m2d_5", 0, 1, {}], ["conv_lst_m2d_5", 0, 2, {}]], [["conv_lst_m2d_4", 2, 0, {}], ["conv_lst_m2d_5", 1, 1, {}], ["conv_lst_m2d_5", 1, 2, {}]], [["conv_lst_m2d_4", 3, 0, {}], ["conv_lst_m2d_5", 2, 1, {}], ["conv_lst_m2d_5", 2, 2, {}]], [["conv_lst_m2d_4", 4, 0, {}], ["conv_lst_m2d_5", 3, 1, {}], ["conv_lst_m2d_5", 3, 2, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_2", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_2", "op": "StridedSlice", "input": ["input_6", "strided_slice_2/begin", "strided_slice_2/end", "strided_slice_2/strides"], "attr": {"T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}}}, "constants": {"1": [0, 0, 0], "2": [0, 1, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_2", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_3", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_3", "op": "StridedSlice", "input": ["input_5", "strided_slice_3/begin", "strided_slice_3/end", "strided_slice_3/strides"], "attr": {"end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, "constants": {"1": [0, 0], "2": [0, 1], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_3", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}], ["conv_lst_m2d_4", 0, 0, {}], ["conv_lst_m2d_5", 0, 0, {}]], [["lambda", 0, 0, {}], ["lambda", 1, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_4", 0, 0, {}]], [["conv_lst_m2d_3", 1, 0, {}], ["conv_lst_m2d_4", 1, 0, {}], ["conv_lst_m2d_5", 1, 0, {}]], [["lambda", 3, 0, {}], ["lambda", 4, 0, {}]], [["lambda_5", 0, 0, {}], ["lambda_6", 0, 0, {}]], [["conv_lst_m2d_3", 2, 0, {}], ["conv_lst_m2d_4", 2, 0, {}], ["conv_lst_m2d_5", 2, 0, {}]], [["lambda", 6, 0, {}], ["lambda", 7, 0, {}]], [["lambda_7", 0, 0, {}], ["lambda_8", 0, 0, {}]], [["conv_lst_m2d_3", 3, 0, {}], ["conv_lst_m2d_4", 3, 0, {}], ["conv_lst_m2d_5", 3, 0, {}]], [["lambda", 9, 0, {}], ["lambda", 10, 0, {}]], [["lambda_9", 0, 0, {}], ["lambda_10", 0, 0, {}]], [["conv_lst_m2d_3", 4, 0, {}], ["conv_lst_m2d_4", 4, 0, {}], ["conv_lst_m2d_5", 4, 0, {}]], [["lambda", 12, 0, {}], ["lambda", 13, 0, {}]], [["lambda_11", 0, 0, {}], ["lambda_12", 0, 0, {}]]]}, {"class_name": "DecayLayer", "config": {"name": "decay_layer", "trainable": true, "dtype": "float32", "output_dim": 1}, "name": "decay_layer", "inbound_nodes": [[["tf_op_layer_strided_slice_2", 0, 0, {}]], [["tf_op_layer_strided_slice_6", 0, 0, {}]], [["tf_op_layer_strided_slice_10", 0, 0, {}]], [["tf_op_layer_strided_slice_14", 0, 0, {}]], [["tf_op_layer_strided_slice_18", 0, 0, {}]]]}, {"class_name": "DecayLayer", "config": {"name": "decay_layer_1", "trainable": true, "dtype": "float32", "output_dim": 1}, "name": "decay_layer_1", "inbound_nodes": [[["tf_op_layer_strided_slice_3", 0, 0, {}]], [["tf_op_layer_strided_slice_7", 0, 0, {}]], [["tf_op_layer_strided_slice_11", 0, 0, {}]], [["tf_op_layer_strided_slice_15", 0, 0, {}]], [["tf_op_layer_strided_slice_19", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["concatenate", 0, 0, {}], ["decay_layer", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["concatenate", 1, 0, {}], ["decay_layer_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcyIAAAB8AGQAZACFAmQBZABkAIUCZABkAIUCZABkAIUCZgUZ\nAFMAKQJO6QAAAACpACkB2gF4cgIAAAByAgAAAPoUY29udkxTVE1fbmV3RGVjYXkucHnaCDxsYW1i\nZGE+RgAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["concatenate", 2, 0, {}]], [["concatenate", 5, 0, {}]], [["concatenate", 8, 0, {}]], [["concatenate", 11, 0, {}]], [["concatenate", 14, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 126, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_1", 1, 0, {}]], [["lambda_1", 2, 0, {}]], [["lambda_1", 3, 0, {}]], [["lambda_1", 4, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["conv2d", 0, 0, {}]], [["conv2d", 1, 0, {}]], [["conv2d", 2, 0, {}]], [["conv2d", 3, 0, {}]], [["conv2d", 4, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]], [["conv2d_1", 1, 0, {}]], [["conv2d_1", 2, 0, {}]], [["conv2d_1", 3, 0, {}]], [["conv2d_1", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABDAAAAcxIAAAB8AHQAagF8AGQFZASNAhsAUwApBk7pAQAAAOkCAAAA\n6QMAAAApAdoEYXhpcykDcgEAAAByAgAAAHIDAAAAKQLaAUvaA3N1bSkB2gF4qQByCAAAAPoUY29u\ndkxTVE1fbmV3RGVjYXkucHnaCDxsYW1iZGE+SwAAAHMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]], [["conv2d_2", 1, 0, {}]], [["conv2d_2", 2, 0, {}]], [["conv2d_2", 3, 0, {}]], [["conv2d_2", 4, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_4", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_4", "op": "StridedSlice", "input": ["input_3", "strided_slice_4/begin", "strided_slice_4/end", "strided_slice_4/strides"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "29"}, "begin_mask": {"i": "29"}, "ellipsis_mask": {"i": "0"}}}, "constants": {"1": [0, 1, 0, 0, 0], "2": [0, 2, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_4", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_5", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_5", "op": "StridedSlice", "input": ["input_4", "strided_slice_5/begin", "strided_slice_5/end", "strided_slice_5/strides"], "attr": {"shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "29"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "29"}}}, "constants": {"1": [0, 1, 0, 0, 0], "2": [0, 2, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_5", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_6", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_6", "op": "StridedSlice", "input": ["input_6", "strided_slice_6/begin", "strided_slice_6/end", "strided_slice_6/strides"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "begin_mask": {"i": "5"}, "shrink_axis_mask": {"i": "2"}}}, "constants": {"1": [0, 1, 0], "2": [0, 2, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_6", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_7", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_7", "op": "StridedSlice", "input": ["input_5", "strided_slice_7/begin", "strided_slice_7/end", "strided_slice_7/strides"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}}}, "constants": {"1": [0, 1], "2": [0, 2], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_7", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["concatenate", 3, 0, {}], ["decay_layer", 1, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["concatenate", 4, 0, {}], ["decay_layer_1", 1, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_8", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_8", "op": "StridedSlice", "input": ["input_3", "strided_slice_8/begin", "strided_slice_8/end", "strided_slice_8/strides"], "attr": {"shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "29"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "29"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 2, 0, 0, 0], "2": [0, 3, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_8", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_9", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_9", "op": "StridedSlice", "input": ["input_4", "strided_slice_9/begin", "strided_slice_9/end", "strided_slice_9/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "29"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "29"}, "shrink_axis_mask": {"i": "2"}}}, "constants": {"1": [0, 2, 0, 0, 0], "2": [0, 3, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_9", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_10", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_10", "op": "StridedSlice", "input": ["input_6", "strided_slice_10/begin", "strided_slice_10/end", "strided_slice_10/strides"], "attr": {"end_mask": {"i": "5"}, "begin_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}}}, "constants": {"1": [0, 2, 0], "2": [0, 3, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_10", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_11", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_11", "op": "StridedSlice", "input": ["input_5", "strided_slice_11/begin", "strided_slice_11/end", "strided_slice_11/strides"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}}}, "constants": {"1": [0, 2], "2": [0, 3], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_11", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["concatenate", 6, 0, {}], ["decay_layer", 2, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_8", "inbound_nodes": [[["concatenate", 7, 0, {}], ["decay_layer_1", 2, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_12", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_12", "op": "StridedSlice", "input": ["input_3", "strided_slice_12/begin", "strided_slice_12/end", "strided_slice_12/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "29"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "29"}}}, "constants": {"1": [0, 3, 0, 0, 0], "2": [0, 4, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_12", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_13", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_13", "op": "StridedSlice", "input": ["input_4", "strided_slice_13/begin", "strided_slice_13/end", "strided_slice_13/strides"], "attr": {"end_mask": {"i": "29"}, "begin_mask": {"i": "29"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, "constants": {"1": [0, 3, 0, 0, 0], "2": [0, 4, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_13", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_14", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_14", "op": "StridedSlice", "input": ["input_6", "strided_slice_14/begin", "strided_slice_14/end", "strided_slice_14/strides"], "attr": {"shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}}}, "constants": {"1": [0, 3, 0], "2": [0, 4, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_14", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_15", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_15", "op": "StridedSlice", "input": ["input_5", "strided_slice_15/begin", "strided_slice_15/end", "strided_slice_15/strides"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, "constants": {"1": [0, 3], "2": [0, 4], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_15", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_9", "inbound_nodes": [[["concatenate", 9, 0, {}], ["decay_layer", 3, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_10", "inbound_nodes": [[["concatenate", 10, 0, {}], ["decay_layer_1", 3, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_16", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_16", "op": "StridedSlice", "input": ["input_3", "strided_slice_16/begin", "strided_slice_16/end", "strided_slice_16/strides"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "29"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "29"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, "constants": {"1": [0, 4, 0, 0, 0], "2": [0, 5, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_16", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_17", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_17", "op": "StridedSlice", "input": ["input_4", "strided_slice_17/begin", "strided_slice_17/end", "strided_slice_17/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "29"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "29"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, "constants": {"1": [0, 4, 0, 0, 0], "2": [0, 5, 0, 0, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_17", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_18", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_18", "op": "StridedSlice", "input": ["input_6", "strided_slice_18/begin", "strided_slice_18/end", "strided_slice_18/strides"], "attr": {"shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "5"}}}, "constants": {"1": [0, 4, 0], "2": [0, 5, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_18", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_19", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_19", "op": "StridedSlice", "input": ["input_5", "strided_slice_19/begin", "strided_slice_19/end", "strided_slice_19/strides"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}}}, "constants": {"1": [0, 4], "2": [0, 5], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_19", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_11", "inbound_nodes": [[["concatenate", 12, 0, {}], ["decay_layer", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQBGQB8AGQCGQAUAFMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+hRjb252TFNUTV9uZXdEZWNheS5wedoHbXVsX3NjYTcAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_12", "inbound_nodes": [[["concatenate", 13, 0, {}], ["decay_layer_1", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oLY29uY2F0ZW5hdGUpAdoBeKkAcgYAAAD6FGNvbnZMU1RNX25ld0RlY2F5LnB52gg8bGFt\nYmRhPuAAAABzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_13", "inbound_nodes": [[["lambda", 2, 0, {}], ["lambda", 5, 0, {}], ["lambda", 8, 0, {}], ["lambda", 11, 0, {}], ["lambda", 14, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "batch_input_shape": [null, 5, 16, 32, 1], "dtype": "float32", "target_shape": [5, 512]}, "name": "reshape", "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0]], "output_layers": [["reshape", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}